/*
==========   Способы создания объекта   =============

1. Литерал объекта
2. Функция-конструктор
3. Object.create()
4. Функция, возвращающая объект

на примере объекта : { age : 20 }
*/

//==============================================================================
// 1. Литерал объекта

let o1 = {
    age : 20
};

console.log(o1);

//==============================================================================
// 2. Функция-конструктор

let ConstrObj = function(age) {
    this.age = age;
}

let o2 = new ConstrObj(20);
console.log(o2);

//==============================================================================
// 3. Object.create()

//Метод Object.create() создаёт новый объект с указанными
// объектом прототипа и свойствами.

//let o = {};  эквивалентно этому: let o = Object.create(Object.prototype);

 let o3 = Object.create(
     Object.prototype,
     { age: { value: 20,
              writable: true,
              enumerable: true,
              configurable: true
             }
     });

console.log(o3);

//==============================================================================
// 4. Функция, возвращающая объект

let constrObj = function(age) {
    return {
        age : age
    }
}

let o4 = constrObj(20);
console.log(o4);

